{
  "summary-of-qualifications": [
    {
      "emoji": "🏆",
      "text": "Self-taught full-stack developer with an expansive online portfolio of cool projects"
    },
    {
      "emoji": "🤓",
      "text": "Avid interest in programming in general; following podcasts, newsletters and picking up new tech just to keep it fresh"
    },
    {
      "emoji": "🤝",
      "text": "Experience with startups, corporations, and volunteer-teams; practicing agile development, and shipping code weekly"
    }
  ],
  "character-sheet": [
    {
      "category": "Frontend",
      "attributes": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "React (like a LOT of React)",
        "Getting Dressed in the Morning",
        "Vue",
        "Styled Components",
        "Redux",
        "Gatsby",
        "Markdown",
        "Apollo"
      ]
    },
    {
      "category": "Backend",
      "attributes": [
        "Node.js",
        "Express",
        "Next",
        "TypeScript",
        "Prisma",
        "NetlifyCMS",
        "Reverse Parking",
        "GraphQL / REST API Development",
        "AWS Suite (S3 / DynamoDB / EB / EC2 / SES / SNS)",
        "JWTs",
        "Firebase",
        "Digital Ocean"
      ]
    },
    {
      "category": "Cool Stuff",
      "attributes": [
        "React Native",
        "iOS/Android Deployment",
        "Standalone Apps (Electron)",
        "Java",
        "Python",
        "Ice Cubes",
        "Site Deployment",
        "Unity 3D with C#",
        "CLI Development",
        "Gitmoji"
      ]
    },
    {
      "category": "Tooling",
      "attributes": [
        "Git",
        "CircleCI",
        "Jest / Mocha / Jasmine",
        "Prettier / ESLint / TSLint",
        "Docker",
        "Zsh / Bash / Cmd",
        "Screwdrivers",
        "Babel / Webpack / Gulp",
        "Appium / Selenium",
        "NPM / Yarn",
        "Netlify"
      ]
    },
    {
      "category": "Concepts",
      "attributes": [
        "MVC",
        "UI/UX",
        "Accessbility",
        "CI/CD",
        "Data Visualization",
        "Server-side Rendering",
        "Code-splitting",
        "A sense of humour",
        "Design Thinking",
        "Dev Ops",
        "Agile Software Development"
      ]
    }
  ],
  "work-experience": [
    {
      "title": "Advanced App Engineering Senior Analyst",
      "location": "Toronto, ON",
      "time": "Fall 2018 (4m)",
      "company": "Accenture",
      "link": "https://www.accenture.com/ca-en",
      "skills": [
        "React",
        "Node",
        "Handlebars",
        "AWS Lambda",
        "AWS Suite",
        "Google Dialogflow",
        "Git Workflows"
      ],
      "bullets": [
        {
          "emoji": "🔨",
          "text": "Designed reusable components in React.js through peer programming and test-driven development"
        },
        {
          "emoji": "🚀",
          "text": "Deployed client-facing widgets for Virtual Agents to satisfy dynamic, natural language use cases"
        },
        {
          "emoji": "📚",
          "text": "Received certified, formal training in DevOps, Agile Development and Design Thinking"
        }
      ]
    },
    {
      "title": "Full-stack React Native Developer",
      "location": "Toronto, ON",
      "time": "Winter 2019 (4m)",
      "company": "Shop Bonsai",
      "link": "https://corp.shopbonsai.ca/",
      "skills": [
        "React",
        "React Native",
        "TypeScript/Flow",
        "GraphQL",
        "MongoDB",
        "Redux",
        "Apollo",
        "Code Review",
        "CI/CD"
      ],
      "bullets": [
        {
          "emoji": "♻️",
          "text": "Refactored GraphQL API resolvers and their respective queries via React Native HOCs to reduce over-fetching"
        },
        {
          "emoji": "📲",
          "text": "Built, and shipped feature sets in weekly app updates throughout the term "
        },
        {
          "emoji": "✅",
          "text": "Implemented E2E tests in Jasmine and Selenium, along with fixtures, for consistent, black-box reporting in CircleCI"
        },
        {
          "emoji": "🏗️",
          "text": "Overhauled atomic design system for React UI elements on both iOS and Android operating systems"
        },
        {
          "emoji": "⚡",
          "text": "Actively participated in small-team Agile development activities like Scrum, Planning Poker and Sprints"
        }
      ]
    }
  ],
  "education": [
    {
      "title": "Nanotechnology Engineering",
      "location": "University of Waterloo",
      "time": "Sep 2016 - Present",
      "link": "https://uwaterloo.ca/",
      "description": "Currently a candidate for a B.A.Sc. Honors Nanotechnology Engineering at the University of Waterloo. My program gives me the opportunity to work with/study the latest and greatest in tech, research and science, while learning the fundamentals of engineering. "
    },
    {
      "title": "Fullstack Advanced React & GraphQL",
      "location": "AdvancedReact.com",
      "time": "Sep 2019",
      "link": "https://advancedreact.com/",
      "description": "Another Wes Bos course, this time focusing on implementing the latest and greatest design patterns with React, all with a slick, modern stack. GraphQL + Prisma + Node on the backend, and React with Apollo Client on the frontend. Next.js actually powers the React app as well, giving some added speed, server-side rendering and easy routing!"
    },
    {
      "title": "How to GraphQL (Frontend + Backend)",
      "location": "HowToGraphQL.com",
      "time": "Jan 2019",
      "link": "https://www.howtographql.com/",
      "description": "Completed BOTH (yeah you read that write 💪💪) of the courses on creating, and implementing a GraphQL API. The backend course focused on designing the API with Node.js and Prisma, while the frontend course was all about interacting with it (with React and Apollo Client). It ended up coming together in sick, well-implemented clone of Hacker News! "
    },
    {
      "title": "Learn Node",
      "location": "LearnNode.com",
      "time": "Nov 2018",
      "link": "https://learnnode.com",
      "description": "An introductory course to Node.js  (+ Express) taught by the web-acclaimed Wes Bos. In it, I built a fully functional restaurant review service, with a database interface, clean, server-templated UI, and Google Maps capabilities. It even enforced some awesome MVC design patterns!"
    },
    {
      "title": "React for Beginners",
      "location": "ReactForBeginners.com",
      "time": "Oct 2018",
      "link": "https://reactforbeginners.com",
      "description": "A beginner's project-driven React development course taught by Wes Bos. It covers everything from ES6, to Webpack, and even Firebase Authentication. It covers lifecycle methods, state management, and application structure while creating an application to manage a simple fish market!"
    },
    {
      "title": "React 101",
      "location": "Codecademy.com",
      "time": "Apr 2018",
      "link": "https://www.codecademy.com",
      "description": "An introductory course to using React which was focused on the basics, but sparked my interest in the JavaScript framework, and set a foundation for future projects and endeavors."
    },
    {
      "title": "Front End Development Certification",
      "location": "FreeCodeCamp.org",
      "time": "Mar 2018",
      "link": "https://www.freecodecamp.org",
      "description": "During my free time of my second coop term, I decided that I wanted to get back into the programming world, and searched for some good courses/resources online. About 2.5 months later, I'd completed a series of projects/challenges in this intensive course covering the basics of web development."
    }
  ],
  "volunteer-work": [
    {
      "title": "UW Blueprint",
      "location": "UWBlueprint.org",
      "time": "Presently!",
      "link": "https://uwblueprint.org/",
      "description": "Blueprint is an initiative at the University of Waterloo to provide tech for nonprofits. A bunch of times every week, teams get together and work on building cool stuff for social good, and I'm a part of it! We work in Agile sprints, providing web apps, analysis tools and infrastructure to nonprofits every term - free of charge!"
    },
    {
      "title": "#HourOfCode Mentor",
      "location": "John Ross Robertson Public School, Toronto ON",
      "time": "Dec 4, 2018",
      "link": "https://hourofcode.com/ca",
      "description": "With a few other volunteers from the team of developers from Accenture Technology Canada, I was able to help Grade 3's and 4's write their first few lines of JavaScript, all for the #HourOfCode initiative! Answering basic questions, helping them get started, and explaining stuff like 'if statements', and helping get those 'future-programmer' wheels turning."
    },
    {
      "title": "Women in STEM Program Assistant",
      "location": "University of Waterloo",
      "time": "Oct 13, 2018",
      "link": "https://uwaterloo.ca/stem-opportunities-girls/",
      "description": "Joined a team of representatives from Accenture Technology Canada in running through workshops about 'Design Thinking' for future University students. As one of the youngest reps, I also got the chance to talk about what they can expect at the University of Waterloo, and the opportunities that await them as young women in STEM fields!"
    }
  ],
  "achievements": [
    {
      "title": "100 Days of Code",
      "location": "My Basement",
      "time": "Oct 2018 - Jan 2019",
      "link": "https://twitter.com/LeeAndHer/status/1084678532377137153",
      "description": "After a long 4 months at school, I wanted to get back into programming in a big way. I started coding for at least an hour a day for 100 Days, and lo and behold, I got a bunch of stuff done! "
    },
    {
      "title": "DRW Lightning Challenge Winner",
      "location": "Hack the North 2019",
      "time": "Sep 14, 2019",
      "link": "https://twitter.com/LeeAndHer/status/1172980584781635584",
      "description": "DRW sponsored Hack The North with a data restructuring/parsing coding challenge, the winner of which would get an awesome branded speaker. Well, after a little over 20 minutes, I managed to take that speaker home!"
    },
    {
      "title": "IC Agile Professional Certification",
      "location": "International Consortium for Agile",
      "time": "Sep 2018",
      "link": "https://icagile.com/",
      "description": "As part of my term with Accenture Canada, I traveled to Chicago, Illinois to complete a two-week intensive training on the basics of technology development. As part of it, I received a certification in professional agile software development for completing a three-day accredited course!"
    },
    {
      "title": "President's Scholarship",
      "location": "University of Waterloo",
      "time": "Sep 2016",
      "link": "http://uwaterloo.ca",
      "description": "Earned a big ol' entrance scholarship of $2000.00 upon my admission to the University of Waterloo since my high school grade point average was greater than 90%."
    }
  ],
  "weird-stuff": [
    "I recently starting getting _super_ into board games. Some of my favourites are _Dead of Winter_, _Coup_, _Spirit Island_, and _Betrayal at House on the Hill_. I also play a ton of video games, so you can quiz me if you want.",
    "I am a **_total podcast junkie_**. I'm listening to podcasts whenever I'm doing anything with my hands, even coding on occasion. As of this moment, I'm subscribed to around 25. Top recommendations include: _Reply All_, _Everything is Alive_, _Syntax_, _My Brother, My Brother and Me,_ and _Cortex_.\n\nI might actually be starting my own, so keep your ears peeled 👀👂👀👂",
    "I am an unwavering **dog** person, but sadly I don't have a cute puppy of my own just yet. When I move out, adopting a _pitbull_ or _shiba_ is definitely the top priority. In the mean time though, me and my roommates are taking care of another pal's kitten, and I am trying to teach him to fetch.",
    "I prefer **VSCode** to Atom, I really enjoy programming in **JavaScript**, **React** is my preferred framework, but I'm actively exploring Vue, and I think `if` statement curly braces don't deserve their own lines. For more opinions to disagree with check out my [/about](https://www.leander.xyz/about) page."
  ]
}
