{
  "summary-of-qualifications": [
    {
      "emoji": "🖥️",
      "text": "Self-taught full-stack developer with experience in startups, big tech companies, volunteering teams and open-source"
    },
    {
      "emoji": "🤓",
      "text": "Keen interest in computer science and best practices evidenced through a portfolio of neat projects"
    },
    {
      "emoji": "👋",
      "text": "Genuinely interested in having a conversation with you!"
    }
  ],
  "character-sheet": [
    {
      "category": "Frontend",
      "attributes": [
        "HTML5",
        "CSS3",
        "JavaScript",
        "TypeScript",
        "React (like a LOT of React)",
        "Getting Dressed in the Morning",
        "Vue",
        "Styled Components",
        "Redux",
        "Gatsby",
        "Markdown",
        "Apollo"
      ]
    },
    {
      "category": "Backend",
      "attributes": [
        "Node.js",
        "Express",
        "Prisma",
        "Django",
        "Reverse Parking",
        "GraphQL / REST APIs",
        "AWS Suite (S3 / DynamoDB / EB / EC2 / SES / SNS)",
        "JWTs + OAuth",
        "Firebase",
        "Digital Ocean",
        "Celery",
        "Redis"
      ]
    },
    {
      "category": "Cool Stuff",
      "attributes": [
        "React Native",
        "Java",
        "Python",
        "Ice Cubes",
        "Site Deployment",
        "Minecraft Development",
        "CLI Development",
        "Gitmoji"
      ]
    },
    {
      "category": "Tooling",
      "attributes": [
        "Git",
        "CircleCI",
        "GH Actions",
        "RTS / Jest / Enzyme",
        "Pytest",
        "Docker",
        "Screwdrivers",
        "Netlify"
      ]
    },
    {
      "category": "Concepts",
      "attributes": [
        "MVC",
        "TDD",
        "UI/UX",
        "Accessibility",
        "CI/CD",
        "Data Visualization",
        "SSR",
        "Code-splitting",
        "A sense of humour",
        "Design Thinking",
        "Agile"
      ]
    }
  ],
  "work-experience": [
    {
      "title": "Software Engineer [Ecosystem + Enterprise]",
      "location": "San Francisco, CA",
      "time": "Aug 2021 - Present",
      "company": "Sentry",
      "link": "https://sentry.io",
      "skills": [
        "React",
        "TypeScript",
        "Python",
        "Django",
        "API Development",
        "Open-Source",
        "SaaS",
        "GCP",
        "Postgres"
      ],
      "bullets": [
        {
          "text": "Built and managed critical features for third party developer\ntool integrations, such as Slack, GitHub and Jira.",
          "emoji": "♻️"
        },
        {
          "emoji": "⚖️",
          "text": "Maintained platform integrity with new features and\nestablished practices for building Apps and using the public API."
        },
        {
          "emoji": "🗺️",
          "text": "Led data residency initiative with respect to integrations as\nSentry scaled to support international customers"
        }
      ]
    },
    {
      "title": "Software Engineer [Recruiting Tools]",
      "location": "Toronto, ON (Remote)",
      "time": "Spring 2020 (4m)",
      "company": "Facebook",
      "link": "https://about.facebook.com/",
      "skills": [
        "PHP (Hack)",
        "React",
        "GraphQL",
        "Relay",
        "Phabricator"
      ],
      "bullets": [
        {
          "emoji": "🎉",
          "text": "Produce rapid full-stack feature changes and product revisions from the design-stage"
        },
        {
          "emoji": "🔌",
          "text": "Connected and aligned cross-functional teams on project scope, status and deviations"
        },
        {
          "emoji": "🧰",
          "text": "Provided substantive new tooling and features to improve users' workflows"
        },
        {
          "emoji": "🔎",
          "text": "Identified and fixed pain-points in UI/UX with design constraints and user-requested deadlines "
        }
      ]
    },
    {
      "title": "Software Engineer",
      "location": "San Francisco, CA",
      "time": "Winter 2020 (4m)",
      "company": "Sentry",
      "link": "https://sentry.io",
      "skills": [
        "React",
        "TypeScript",
        "Python",
        "Django",
        "Celery",
        "GCP",
        "Postgres",
        "Open-Source"
      ],
      "bullets": [
        {
          "text": "Designed product and engineering workflows for high demand features",
          "emoji": "🖋"
        },
        {
          "emoji": "⚡️",
          "text": "Authored full-stack code for feature pipelines and implementations"
        },
        {
          "emoji": "💞",
          "text": "Iterated based on user critique and resource constraints"
        },
        {
          "text": "Finalized work through in-depth documentation and virtual presentations",
          "emoji": "🗃"
        }
      ]
    },
    {
      "title": "Full-stack React Native Developer",
      "location": "Toronto, ON",
      "time": "Winter 2019 (4m)",
      "company": "Shop Bonsai",
      "link": "https://corp.shopbonsai.ca/",
      "skills": [
        "React",
        "React Native",
        "TypeScript/Flow",
        "GraphQL",
        "MongoDB",
        "Redux",
        "Apollo",
        "Code Review",
        "CI/CD"
      ],
      "bullets": [
        {
          "emoji": "♻️",
          "text": "Refactored GraphQL API resolvers and their respective queries via React Native HOCs to reduce over-fetching"
        },
        {
          "emoji": "📲",
          "text": "Built, and shipped feature sets in weekly app updates throughout the term "
        },
        {
          "emoji": "✅",
          "text": "Implemented E2E tests in Jasmine and Selenium, along with fixtures, for consistent, black-box reporting in CircleCI"
        },
        {
          "emoji": "🏗️",
          "text": "Overhauled atomic design system for React UI elements on both iOS and Android operating systems"
        },
        {
          "emoji": "⚡",
          "text": "Actively participated in small-team Agile development activities like Scrum, Planning Poker and Sprints"
        }
      ]
    },
    {
      "title": "Advanced App Engineering Senior Analyst",
      "location": "Toronto, ON",
      "time": "Fall 2018 (4m)",
      "company": "Accenture",
      "link": "https://www.accenture.com/ca-en",
      "skills": [
        "React",
        "Node",
        "Handlebars",
        "AWS Lambda",
        "AWS Suite",
        "Google Dialogflow",
        "Git Workflows"
      ],
      "bullets": [
        {
          "emoji": "🔨",
          "text": "Designed reusable components in React.js through peer programming and test-driven development"
        },
        {
          "emoji": "🚀",
          "text": "Deployed client-facing widgets for Virtual Agents to satisfy dynamic, natural language use cases"
        },
        {
          "emoji": "📚",
          "text": "Received certified, formal training in DevOps, Agile Development and Design Thinking"
        }
      ]
    }
  ],
  "education": [
    {
      "title": "Nanotechnology Engineering",
      "location": "University of Waterloo",
      "time": "Sep 2016 - Apr 2021",
      "link": "https://uwaterloo.ca/",
      "description": "Received a B.A.Sc. Honours Nanotechnology Engineering at the University of Waterloo. My program gives me the opportunity to work with/study the latest and greatest in tech, research and science, while learning the fundamentals of engineering. Pretty cool if you ask me. Self-taught (unless online courses count) dev stuff tho. "
    },
    {
      "title": "Fullstack Advanced React & GraphQL",
      "location": "AdvancedReact.com",
      "time": "Sep 2019",
      "link": "https://advancedreact.com/",
      "description": "Another Wes Bos course, this time focusing on implementing the latest and greatest design patterns with React, all with a slick, modern stack. GraphQL + Prisma + Node on the backend, and React with Apollo Client on the frontend. Next.js actually powers the React app as well, giving some added speed, server-side rendering and easy routing!"
    },
    {
      "title": "How to GraphQL (Frontend + Backend)",
      "location": "HowToGraphQL.com",
      "time": "Jan 2019",
      "link": "https://www.howtographql.com/",
      "description": "Completed BOTH (yeah you read that write 💪💪) of the courses on creating, and implementing a GraphQL API. The backend course focused on designing the API with Node.js and Prisma, while the frontend course was all about interacting with it (with React and Apollo Client). It ended up coming together in sick, well-implemented clone of Hacker News! "
    },
    {
      "title": "Learn Node",
      "location": "LearnNode.com",
      "time": "Nov 2018",
      "link": "https://learnnode.com",
      "description": "An introductory course to Node.js  (+ Express) taught by the web-acclaimed Wes Bos. In it, I built a fully functional restaurant review service, with a database interface, clean, server-templated UI, and Google Maps capabilities. It even enforced some awesome MVC design patterns!"
    },
    {
      "title": "React for Beginners",
      "location": "ReactForBeginners.com",
      "time": "Oct 2018",
      "link": "https://reactforbeginners.com",
      "description": "A beginner's project-driven React development course taught by Wes Bos. It covers everything from ES6, to Webpack, and even Firebase Authentication. It covers lifecycle methods, state management, and application structure while creating an application to manage a simple fish market!"
    },
    {
      "title": "React 101",
      "location": "Codecademy.com",
      "time": "Apr 2018",
      "link": "https://www.codecademy.com",
      "description": "An introductory course to using React which was focused on the basics, but sparked my interest in the JavaScript framework, and set a foundation for future projects and endeavors."
    },
    {
      "title": "Front End Development Certification",
      "location": "FreeCodeCamp.org",
      "time": "Mar 2018",
      "link": "https://www.freecodecamp.org",
      "description": "During my free time of my second coop term, I decided that I wanted to get back into the programming world, and searched for some good courses/resources online. About 2.5 months later, I'd completed a series of projects/challenges in this intensive course covering the basics of web development."
    }
  ],
  "volunteer-work": [
    {
      "title": "Project Program Judge",
      "location": "csclub.uwaterloo.ca/",
      "link": "https://csclub.uwaterloo.ca/",
      "time": "Dec 4, 2021",
      "description": "Judged the Project Program competition for the University of Waterloo Computer Science and Data Science clubs! The competition was between first year students who worked alongside upper year mentors to develop applications in about a month. Judging was done across a variety of categories (e.g. extensibility, complexity, etc.) to award the three lucky teams!"
    },
    {
      "title": "UW Blueprint",
      "location": "UWBlueprint.org",
      "time": "2019",
      "link": "https://uwblueprint.org/",
      "description": "Blueprint is an initiative at the University of Waterloo to provide tech for nonprofits. A bunch of times every week, teams get together and work on building cool stuff for social good, and I'm a part of it! We work in Agile sprints, providing web apps, analysis tools and infrastructure to nonprofits every term - free of charge!"
    },
    {
      "title": "#HourOfCode Mentor",
      "location": "John Ross Robertson Public School, Toronto ON",
      "time": "Dec 4, 2018",
      "link": "https://hourofcode.com/ca",
      "description": "With a few other volunteers from the team of developers from Accenture Technology Canada, I was able to help Grade 3's and 4's write their first few lines of JavaScript, all for the #HourOfCode initiative! Answering basic questions, helping them get started, and explaining stuff like 'if statements', and helping get those 'future-programmer' wheels turning."
    },
    {
      "title": "Women in STEM Program Assistant",
      "location": "University of Waterloo",
      "time": "Oct 13, 2018",
      "link": "https://uwaterloo.ca/stem-opportunities-girls/",
      "description": "Joined a team of representatives from Accenture Technology Canada in running through workshops about 'Design Thinking' for future University students. As one of the youngest reps, I also got the chance to talk about what they can expect at the University of Waterloo, and the opportunities that await them as young women in STEM fields!"
    }
  ],
  "achievements": [
    {
      "title": "100 Days of Code",
      "location": "My Basement",
      "time": "Oct 2018 - Jan 2019",
      "link": "https://twitter.com/LeeAndHer/status/1084678532377137153",
      "description": "After a long 4 months at school, I wanted to get back into programming in a big way. I started coding for at least an hour a day for 100 Days, and lo and behold, I got a bunch of stuff done! "
    },
    {
      "title": "DRW Lightning Challenge Winner",
      "location": "Hack the North 2019",
      "time": "Sep 14, 2019",
      "link": "https://twitter.com/LeeAndHer/status/1172980584781635584",
      "description": "DRW sponsored Hack The North with a data restructuring/parsing coding challenge, the winner of which would get an awesome branded speaker. Well, after a little over 20 minutes, I managed to take that speaker home!"
    },
    {
      "title": "IC Agile Professional Certification",
      "location": "International Consortium for Agile",
      "time": "Sep 2018",
      "link": "https://icagile.com/",
      "description": "As part of my term with Accenture Canada, I traveled to Chicago, Illinois to complete a two-week intensive training on the basics of technology development. As part of it, I received a certification in professional agile software development for completing a three-day accredited course!"
    },
    {
      "title": "President's Scholarship",
      "location": "University of Waterloo",
      "time": "Sep 2016",
      "link": "http://uwaterloo.ca",
      "description": "Earned a big ol' entrance scholarship of $2000.00 upon my admission to the University of Waterloo since my high school grade point average was greater than 90%."
    }
  ],
  "interests": [
    "One of my biggest hobbies is gaming! From table top role playing games, to designer board games, to AAA video games, I'm on a quest to grow my backlog to a size never before seen by human eyes. Some of my recent board game favourites have been *Everdell*, and *Betrayal at House on the Hill*! For video games, I absolutely adore *Hollow Knight*, and most *Kingdom Hearts* games, to name a few.",
    "I think I listen to more podcasts than music. I'm listening to podcasts whenever I'm doing anything with my hands, even coding on occasion. As of this moment, I'm subscribed to around 40+, though only about half update weekly. Top recommendations include: *Reply All*, *Everything is Alive*, *My Brother, My Brother and Me,* and *Cortex*.\n\nI also have my own podcast you can check out at <https://jumpcut.fm>",
    "I am far too deep down the rabbit hole of **mechanical keyboards**. I know that hobby is crowded by Software Engineers, but I can't avoid the stereotype! I just love me some colourful rectangles. I'd love to show you the collection if you're interested (but people rarely are, lmao)",
    "One of my current hobbies is *stationery + fountain pens*! I don't have excellent handwriting, but that doesn't stop my friends and I from mailing each other handwritten letters every few weeks. We decorate them with designer paper/stickers/tapes, and I use it as an excuse to stop staring at screens for 10+ hours a day."
  ]
}